--
-- Copyright (c) 2020 by Ludicrous Speed, LLC
-- All rights reserved.
--
local provider={name=...,data=2,region="kr",faction=2,date="2020-12-10T06:02:03Z",currentRaid={["name"]="Castle Nathria",["shortName"]="CN",["bossCount"]=10},previousRaid=nil,db2={}}
local F

F = function() provider.db2["아즈샤라"]={0,"Babyskin","Dread","Ezlock","Karmin","Littleguys","Pukei","Rezu","Widme","Wrongnum","가세요","간지판다수호병","구두쇠","굴그토크시작해","귤농장","김배배","껀노임","꼬므토끼","꼬므팬더","꼬므푸우","나이트본생석","능숙한찰스","다람쥐","닭괴물","더러워서흑마","도사곰돌이","동키콩","따야","또나까","라카치노","로즈콩","리븐델브로큰하트","마나차","마녀따","마법사윈드러너","모카힐","바이러스","백살겅듀","봄이무아","빛샘을클릭합시다","뿌꼰대","사냥여신","사제좀하더놈","서리백작","셀모","시나몬아몬드","쌈군분자","쏘도적","씹덕살인마","아스부","악담","안드로메다화이트","앰오","야성다람쥐","여우도구","연힐트","욱이스","윤떠니개여신","윤성채","으뜸","은신술","인디마격","잉경이","자라나라츄럴머리","재롱덩어리","재밌다람쥐","정신동결자","제로마격","제무사제","젤리뽀","젤리토끼","조각","짜증나","짤로","체코브로우","측면갑","코르크론야수","코코아밍","타비아","탕수육회쳐먹음","파닥경고","파닭경고","파수병","폭키나이트","폴라빛","피로회복제","피치블로우","하늘빛악마","하코링","행쇼","헬러너","혜랑수도사","홀트킹","화작난로","흑사덫","흥마떼로드"} end F()
F = function() provider.db2["데스윙"]={190,"김꽃빵","내여자의열매","브루니","시간의혼돈"} end F()

F = nil
RaiderIO.AddProvider(provider)
